package by.jonline.basic.cycle;

import java.math.BigInteger;


/**
 * @author Sergey Klimuk
 *
 *   	1. Basics of software code development
 *   
 *   	Циклы
 *
 *   	Задание 4
 *	
 *		Составить программу нахождения произведения квадратов первых 
 *	двухсот чисел
 */

public class Task04 {

	public  static void main(String[] args) {

        //Вывод результата в различных типах данных
        int multiInt = 1;
        double multiDouble = 1;
        BigInteger multiBig = BigInteger.valueOf(1);

        for (int i = 2; i <= 200; i++) {
            multiInt *= i * i;
            multiDouble *= i * i;
            multiBig = multiBig.multiply(BigInteger.valueOf(i * i));
        }

        System.out.println("multiInt = " + multiInt);
        System.out.println("multiDouble = " + multiDouble);
        System.out.println("multiBig = " + multiBig);
    }
}

/*
   Результат работы программы:

multiInt = 0
multiDouble = Infinity
multiBig = 621981231756379489999997501700030226361030042908402135795585416076780567701229627071194748755274771867550481130867332728398608915678217606208944334143532903157416015053231992085653846275159616127812272870349795208758168675609821292383968189620347359298821336964567268936282003057371855944848505049857604569455105033587666178052186125598590101814860460233644389300432456960009702905584857393518877079243717213370983146491503406155228997954249347719005783769360467152555665800216223615428450836858053400856713359967484823371026535062161096211713506798207812398746913836648755132232834523663952442186966337759051603462287553956523494664588575257708095078400000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000

 */
