package by.jonline.algoritmization.multi_array;

import java.util.Random;

/**
 * @author Sergey Klimuk
 *
 *   	2. Algoritmization
 *   
 *   	Задачи. Массивы массивов
 *
 *   	Задание 7
 *	
 *		Сформировать квадратную матрицу порядка N по правилу
 *                  A[I, J] = sin((I^2 - J^2) / N);
 *  и подсчитать количество положительных элементов в ней.
 *	
 */

public class Task07 {

	public static void main(String[] args) {

        // Задаем размерность матрицы
        int n = 10;

        // Счетчик положительных элементов матрицы
        int count = 0;

        // Создаем заданную матрицу
        double[][] a = new double[n][n];
        for (int i = 0; i < n; i++) {
            for (int j = 0; j < n; j++) {
                a[i][j] = Math.sin((double)(i * i - j * j) / n);
                    if (a[i][j] > 0)
                        count++;
            }
        }

        // Выводим созданный массив в консоль
        System.out.print("Созданная матрица: \n");
        printArray(a);

        System.out.println("Количество положительных элементов матрицы = " + count);
    }

    // Вывод массива на консоль
    static  void printArray(double[][] array) {
        for (double[] line : array) {
            for (double n : line) {
                System.out.printf("\t%.3f", n);
            }
            System.out.println();
        }
        System.out.println();
    }
}

/*
   Результат работы программы:

Созданная матрица: 
	0,000	-0,100	-0,389	-0,783	-1,000	-0,598	0,443	0,982	-0,117	-0,970
	0,100	0,000	-0,296	-0,717	-0,997	-0,675	0,351	0,996	-0,017	-0,989
	0,389	0,296	0,000	-0,479	-0,932	-0,863	0,058	0,978	0,279	-0,988
	0,783	0,717	0,479	0,000	-0,644	-1,000	-0,427	0,757	0,706	-0,794
	1,000	0,997	0,932	0,644	0,000	-0,783	-0,909	0,158	0,996	-0,215
	0,598	0,675	0,863	1,000	0,783	0,000	-0,891	-0,675	0,688	0,631
	-0,443	-0,351	-0,058	0,427	0,909	0,891	0,000	-0,964	-0,335	0,978
	-0,982	-0,996	-0,978	-0,757	-0,158	0,675	0,964	0,000	-0,997	0,058
	0,117	0,017	-0,279	-0,706	-0,996	-0,688	0,335	0,997	0,000	-0,992
	0,970	0,989	0,988	0,794	0,215	-0,631	-0,978	-0,058	0,992	0,000

Количество положительных элементов матрицы = 45

 */